{"basics":{"name":"Adam Aufderheide","label":"Aeronautical and Astronautical Engineer","email":"adam.aufdi@gmail.com","phone":"262-261-3875","url":"https://adamaufdi.github.io/","summary":"Undergraduate aeronautical and astronautical engineer with experience in design, automation, and navigation systems and skills in CAD, programming, and electrical system design.","location":{"address":"Mequon, WI 53092","city":"Mequon","region":"Wisconsin","countryCode":"US"},"profiles":[{"network":"LinkedIn","username":"adam-aufderheide","url":"https://www.linkedin.com/in/adam-aufderheide"},{"network":"GitHub","username":"adamaufdi","url":"https://github.com/adamaufdi"}]},"work":[{"name":"Purdue Department of Aeronautics and Astronautics","position":"Undergraduate Research Assistant","startDate":"2023-11-01","summary":"Synthesized LROC image data in Blender to design a high-fidelity 3D model of the moon. Developed automated pipelines for visual navigation testing using MATLAB, Python, and Blender. Simulated spacecraft landings and applied vSLAM algorithms for localization and mapping. Wrote Gaussian mixture fusion algorithms for distributed navigation in Python.","highlights":["Synthesized LROC image data in Blender to design a high-fidelity 3D model of the moon.","Created an automated pipeline for testing visual navigation algorithms using MATLAB, Python, and Blender for image rendering.","Simulated spacecraft landings to test vSLAM’s viability in instantaneously mapping extraterrestrial terrain.","Utilized vSLAM technology by applying Python algorithms to localize the camera’s position and map landmark locations.","Wrote partial state Gaussian mixture fusion algorithms for distributed navigation and tracking in Python."]},{"name":"Komatsu Mining","position":"Automation Engineering Intern","startDate":"2025-05-01","endDate":"2025-08-31","summary":"Prototyped and tested modular sensor platforms integrating radar, lidar, GPS, and cameras for autonomous vehicles. Designed custom sensor mounts and PCBs. Developed electrical system architecture for power, safety, and compute integration. Collaborated across teams to validate hardware integration.","highlights":["Carried out the mechanical and electrical prototyping, design, fabrication, and testing of a modular sensor platform for a software-defined autonomous vehicle, integrating radar, lidar, GPS, and camera systems.","Engineered custom sensor mounts using bent steel and 3D printing to optimize field of view, thermal performance, and modularity.","Designed and implemented a custom PCB to interface a motor controller, an RC receiver, a CAN network, and motor encoders.","Developed and implemented the electrical system architecture, including power distribution, safety systems, and compute integration (Intel NUC, Nvidia Jetson), supporting a 680W load.","Collaborated cross-functionally to validate hardware and ensure seamless integration with perception and autonomy stacks, delivering a fully functional testbed."]}],"education":[{"institution":"Purdue University","area":"Aeronautical and Astronautical Engineering","studyType":"Bachelor of Science","startDate":"2023-08-01","endDate":"2026-12-01","gpa":"3.50","location":"West Lafayette, IN","courses":["Notable coursework: Modern Vehicle Avionics, Control System Analysis, Air-Breathing Propulsion, Spacecraft Attitude Dynamics, Aerodynamics, Thermal Sciences, Structural Analysis, Dynamics and Vibrations, Introduction to Aerospace Design, Aeromechanics I/II, National Security and Defense, Signal Analysis, Thermodynamics, Fluid Mechanics, C Programming"]}],"skills":[{"name":"Skills","keywords":["Proficient in CAD modeling software: Solidworks, NX, Autodesk Inventor, Autodesk Fusion 360, and others","Experienced in Finite Element Analysis (FEA) simulations","Skilled in PLM/PDM workflows and technical writing standards","Programming languages: MATLAB, Python, C; experienced with Git workflows","Operate 3D printing, laser cutting, and CNC machines efficiently","Familiar with manufacturing standards and techniques","Experienced in electrical system design, circuitry, schematic reading/writing, and PCB design","Problem solving, root-cause analysis, failure analysis, and iterative design"]}],"projects":[{"name":"Purdue Space Program (Students for the Exploration and Development of Space)","position":"Design Engineer","startDate":"2023-08-01","summary":"Worked on liquid rocketry team to develop motor and fin support structures and injector design. Performed Finite Element Analysis to simulate stress and optimize CAD models.","highlights":["Worked on the liquid rocketry team to develop motor and fin support structures and the injector for a propulsion system.","Used Finite Element Analysis to simulate stress/strain and create efficient pocketing patterns and weight distribution in CAD models of rocket parts."]},{"name":"FIRST Robotics Team 8680","position":"Team Captain and Mechanical Design Lead","startDate":"2019-08-01","endDate":"2023-05-01","summary":"Led design and prototyping of autonomous and driver-controlled robots using advanced sensors and odometry. Managed a 15-member team and mentored over 50 students. Secured ~$100k in sponsorships and achieved top rankings in world competitions.","highlights":["Designed, modeled, and constructed prototypes, 3D models, and final iterations of numerous complex mechanical systems to create functioning autonomous and driver-controlled robots, incorporating deadwheel odometry, various sensors, motors, and servos to allow the robot to complete complex tasks with high precision in under three minutes.","Placed third robot alliance at the 2023 World Championship, ranked seventh team in the all-time hall of fame, winning dozens of competitions and awards.","Managed 15 team members for multiple years and mentored 52 other students, building leadership skills.","Secured roughly 100k in capital through corporate sponsorships/investors and built lasting relations with hundreds of businesses, teams, and individuals globally."]}],"interests":[{"name":"Aerospace Engineering & Space Exploration","keywords":["Rocket propulsion","Spacecraft attitude dynamics and control systems","Avionics and sensing"]}]}